reports/showcase_aero/_w33b_pipe_probe/channel/constant/fluid/g
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b: pure forced convection (Gnielinski) -> g=0, buoyancy off.              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant/fluid";
    object      g;
}

dimensions      [0 1 -2 0 0 0 0];
value           (0 0 0);

// ************************************************************************* //
