reports/showcase_aero/_w33b_pipe_probe/channel/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid U: inlet 3.178922 m/s -> Re_Dh = U*D_h/nu = 3.178922*0.05/1.589461e-5 = 10000 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}

Uinlet          (15.894610 0 0);   // Re_Dh = U*D_h/nu = 15.894610*0.05/1.589461e-5 = 50000

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            noSlip;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
