reports/showcase_aero/_w33b_pipe_probe/channel/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid p_rgh (= p since g=0). outlet fixed gauge 0.                       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    fluid_to_solid
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
