reports/showcase_aero/_w33b_pipe_probe/channel/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid T: cold inlet 300 K; conjugate coupling at interface.             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            coupledTemperature;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
