reports/showcase_aero/_w33b_pipe_probe/channel/0/fluid/k
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid k: inlet I=5% (= 0.16 Re^-1/8 for Re=1e4); k ~= 1.5 (U I)^2.       |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.6488;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.04138;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
