reports/showcase_aero/_w33b_pipe_probe/channel/0/fluid/omega
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid omega: mixingLength = 0.07 D_h = 0.0035 m.                         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 420;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.0035;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
