reports/showcase_aero/_w33b_pipe_probe/channel/system/fluid/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b fluid fvSchemes (transient; energy var e for sensibleInternalEnergy).    |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSchemes;
}

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default             none;
    div(phi,U)          Gauss linearUpwind limited;
    turbulence          Gauss limitedLinear 1;
    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,e)          Gauss upwind;       // fully bounded (no T undershoot on sharp wall gradient)
    div(phi,K)          Gauss upwind;
    div(phi,(p|rho))    $turbulence;
    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
