reports/showcase_aero/_w33b_pipe_probe/channel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| W3.3b top-level fvSolution (multiRegion outer loop).                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}

PIMPLE
{
    nOuterCorrectors 1;
}

// ************************************************************************* //
